package data_structures;

import java.math.BigInteger;
import java.util.ArrayList;
import java.util.List;

public class Lesson1 {
  /*
  Определить сложность следующих алгоритмов:

-. Поиск элемента массива с известным индексом                  O(1)
-. Дублирование одномерного массива через foreach               O(n)
-. Удаление элемента массива с известным индексом без сдвига    O(n)
-. Удаление элемента массива с неизвестным индексом без сдвига  O(n)
-. Удаление элемента массива с неизвестным индексом со сдвига   O(n^2)


Определить сложность следующих алгоритмов. Сколько произойдет итераций?

a) O(n logn)  140000 итераций
b) O(n^2)     25005000 итераций
c) O(n)       10000 итераций
d) O(1)       1 итерация
e) O(n^2)
   */

}
